# Import and Export Files

# Challenge 0 - Accessing our database
Create a connection to access the sakila database with the ip, user and password provided in class. Take a look at the data. Do some joins in order to have more elaborated tables in a dataframe (you can try first the query in the DBMS and then use it in your notebook).

In [1]:
# your code here
import mysql.connector
cnx = mysql.connector.connect(user = 'root',password = 'daniela1', host ='localhost', database = 'sakila')
cnx.is_connected()
cursor = cnx.cursor()
query = ("SELECT * FROM sakila.actor;")
cursor.execute(query)
results = cursor.fetchall()

In [2]:
for element in results:
    print('full name: '+element[1]+' '+element[2])

full name: PENELOPE GUINESS
full name: NICK WAHLBERG
full name: ED CHASE
full name: JENNIFER DAVIS
full name: JOHNNY LOLLOBRIGIDA
full name: BETTE NICHOLSON
full name: GRACE MOSTEL
full name: MATTHEW JOHANSSON
full name: JOE SWANK
full name: CHRISTIAN GABLE
full name: ZERO CAGE
full name: KARL BERRY
full name: UMA WOOD
full name: VIVIEN BERGEN
full name: CUBA OLIVIER
full name: FRED COSTNER
full name: HELEN VOIGHT
full name: DAN TORN
full name: BOB FAWCETT
full name: LUCILLE TRACY
full name: KIRSTEN PALTROW
full name: ELVIS MARX
full name: SANDRA KILMER
full name: CAMERON STREEP
full name: KEVIN BLOOM
full name: RIP CRAWFORD
full name: JULIA MCQUEEN
full name: WOODY HOFFMAN
full name: ALEC WAYNE
full name: SANDRA PECK
full name: SISSY SOBIESKI
full name: TIM HACKMAN
full name: MILLA PECK
full name: AUDREY OLIVIER
full name: JUDY DEAN
full name: BURT DUKAKIS
full name: VAL BOLGER
full name: TOM MCKELLEN
full name: GOLDIE BRODY
full name: JOHNNY CAGE
full name: JODIE DEGENERES
full name: TOM MIRANDA
full name: KIRK JOVOVICH
full name: NICK STALLONE
full name: REESE KILMER
full name: PARKER GOLDBERG
full name: JULIA BARRYMORE
full name: FRANCES DAY-LEWIS
full name: ANNE CRONYN
full name: NATALIE HOPKINS
full name: GARY PHOENIX
full name: CARMEN HUNT
full name: MENA TEMPLE
full name: PENELOPE PINKETT
full name: FAY KILMER
full name: DAN HARRIS
full name: JUDE CRUISE
full name: CHRISTIAN AKROYD
full name: DUSTIN TAUTOU
full name: HENRY BERRY
full name: CHRISTIAN NEESON
full name: JAYNE NEESON
full name: CAMERON WRAY
full name: RAY JOHANSSON
full name: ANGELA HUDSON
full name: MARY TANDY
full name: JESSICA BAILEY
full name: RIP WINSLET
full name: KENNETH PALTROW
full name: MICHELLE MCCONAUGHEY
full name: ADAM GRANT
full name: SEAN WILLIAMS
full name: GARY PENN
full name: MILLA KEITEL
full name: BURT POSEY
full name: ANGELINA ASTAIRE
full name: CARY MCCONAUGHEY
full name: GROUCHO SINATRA
full name: MAE HOFFMAN
full name: RALPH CRUZ
full name: SCARLETT DAMON
full name: WOODY JOLIE
full name: BEN WILLIS
full name: JAMES PITT
full name: MINNIE ZELLWEGER
full name: GREG CHAPLIN
full name: SPENCER PECK
full name: KENNETH PESCI
full name: CHARLIZE DENCH
full name: SEAN GUINESS
full name: CHRISTOPHER BERRY
full name: KIRSTEN AKROYD
full name: ELLEN PRESLEY
full name: KENNETH TORN
full name: DARYL WAHLBERG
full name: GENE WILLIS
full name: MEG HAWKE
full name: CHRIS BRIDGES
full name: JIM MOSTEL
full name: SPENCER DEPP
full name: SUSAN DAVIS
full name: WALTER TORN
full name: MATTHEW LEIGH
full name: PENELOPE CRONYN
full name: SIDNEY CROWE
full name: GROUCHO DUNST
full name: GINA DEGENERES
full name: WARREN NOLTE
full name: SYLVESTER DERN
full name: SUSAN DAVIS
full name: CAMERON ZELLWEGER
full name: RUSSELL BACALL
full name: MORGAN HOPKINS
full name: MORGAN MCDORMAND
full name: HARRISON BALE
full name: DAN STREEP
full name: RENEE TRACY
full name: CUBA ALLEN
full name: WARREN JACKMAN
full name: PENELOPE MONROE
full name: LIZA BERGMAN
full name: SALMA NOLTE
full name: JULIANNE DENCH
full name: SCARLETT BENING
full name: ALBERT NOLTE
full name: FRANCES TOMEI
full name: KEVIN GARLAND
full name: CATE MCQUEEN
full name: DARYL CRAWFORD
full name: GRETA KEITEL
full name: JANE JACKMAN
full name: ADAM HOPPER
full name: RICHARD PENN
full name: GENE HOPKINS
full name: RITA REYNOLDS
full name: ED MANSFIELD
full name: MORGAN WILLIAMS
full name: LUCILLE DEE
full name: EWAN GOODING
full name: WHOOPI HURT
full name: CATE HARRIS
full name: JADA RYDER
full name: RIVER DEAN
full name: ANGELA WITHERSPOON
full name: KIM ALLEN
full name: ALBERT JOHANSSON
full name: FAY WINSLET
full name: EMILY DEE
full name: RUSSELL TEMPLE
full name: JAYNE NOLTE
full name: GEOFFREY HESTON
full name: BEN HARRIS
full name: MINNIE KILMER
full name: MERYL GIBSON
full name: IAN TANDY
full name: FAY WOOD
full name: GRETA MALDEN
full name: VIVIEN BASINGER
full name: LAURA BRODY
full name: CHRIS DEPP
full name: HARVEY HOPE
full name: OPRAH KILMER
full name: CHRISTOPHER WEST
full name: HUMPHREY WILLIS
full name: AL GARLAND
full name: NICK DEGENERES
full name: LAURENCE BULLOCK
full name: WILL WILSON
full name: KENNETH HOFFMAN
full name: MENA HOPPER
full name: OLYMPIA PFEIFFER
full name: GROUCHO WILLIAMS
full name: ALAN DREYFUSS
full name: MICHAEL BENING
full name: WILLIAM HACKMAN
full name: JON CHASE
full name: GENE MCKELLEN
full name: LISA MONROE
full name: ED GUINESS
full name: JEFF SILVERSTONE
full name: MATTHEW CARREY
full name: DEBBIE AKROYD
full name: RUSSELL CLOSE
full name: HUMPHREY GARLAND
full name: MICHAEL BOLGER
full name: JULIA ZELLWEGER
full name: RENEE BALL
full name: ROCK DUKAKIS
full name: CUBA BIRCH
full name: AUDREY BAILEY
full name: GREGORY GOODING
full name: JOHN SUVARI
full name: BURT TEMPLE
full name: MERYL ALLEN
full name: JAYNE SILVERSTONE
full name: BELA WALKEN
full name: REESE WEST
full name: MARY KEITEL
full name: JULIA FAWCETT
full name: THORA TEMPLE

In [3]:
import pandas as pd

actors_df = pd.DataFrame(results)
actors_df["full name"] = actors_df[1] + " " +  actors_df[2] 
actors_df

       0         1             2                   3            full name
0      1  PENELOPE       GUINESS 2006-02-15 04:34:33     PENELOPE GUINESS
1      2      NICK      WAHLBERG 2006-02-15 04:34:33        NICK WAHLBERG
2      3        ED         CHASE 2006-02-15 04:34:33             ED CHASE
3      4  JENNIFER         DAVIS 2006-02-15 04:34:33       JENNIFER DAVIS
4      5    JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33  JOHNNY LOLLOBRIGIDA
..   ...       ...           ...                 ...                  ...
195  196      BELA        WALKEN 2006-02-15 04:34:33          BELA WALKEN
196  197     REESE          WEST 2006-02-15 04:34:33           REESE WEST
197  198      MARY        KEITEL 2006-02-15 04:34:33          MARY KEITEL
198  199     JULIA       FAWCETT 2006-02-15 04:34:33        JULIA FAWCETT
199  200     THORA        TEMPLE 2006-02-15 04:34:33         THORA TEMPLE

[200 rows x 5 columns]

# Challenge 1 - Working with JSON files
Import the pandas library.

In [4]:
# your code here
import pandas as pd

In the next cell, load the data in nasa.json in the data folder and load it into a pandas dataframe. Name the dataframe nasa.

In [5]:
# your code here
nasa=pd.read_json('/Users/danielanogueira/Ironhack/lab-import-export/your-code/nasa.json')

Now that we have loaded the data, let's examine it using the head() function.

In [6]:
# your code here
nasa.head()

,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4,fall,geolocation,id,mass,name,nametype,recclass,reclat,reclong,year
0,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [6.08333, 50....",1,21.0,Aachen,Valid,L5,50.77500,6.08333,1880-01-01T00:00:00.000
1,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [10.23333, 56...",2,720.0,Aarhus,Valid,H6,56.18333,10.23333,1951-01-01T00:00:00.000
2,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-113, 54.216...",6,107000.0,Abee,Valid,EH4,54.21667,-113.00000,1952-01-01T00:00:00.000
3,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-99.9, 16.88...",10,1914.0,Acapulco,Valid,Acapulcoite,16.88333,-99.90000,1976-01-01T00:00:00.000
4,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-64.95, -33....",370,780.0,Achiras,Valid,L6,-33.16667,-64.95000,1902-01-01T00:00:00.000

####  The value_counts() function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the value_counts() function to determine the frequency of all types of asteroid landings by applying the function to the fall column.

In [7]:
# your code here
nasa['fall'].value_counts()

Fell     996
Found      4
Name: fall, dtype: int64

Finally, let's save the dataframe as a json file again. Save the dataframe using the orient=records argument and name the file nasa-output.json. Remember to save the file inside the data folder.

In [8]:
# your code here
nasa.to_json('/Users/danielanogueira/Ironhack/lab-import-export/your-code/nasa-output.json', orient='records')

# Challenge 2 - Working with CSV and Other Separated Files

Import the pandas library

csv files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a csv file into a dataframe directly from a URL without having to load the file first like we did with the JSON URL. The dataset we will be using contains informtaions about NASA shuttles. 

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [9]:
#Your pandas import here:
import pandas as pd

In [10]:
# Run this code:

cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [11]:
# Your code here

shuttle=pd.read_csv(tst_url,names=cols,sep=' ')

Let's verify that this worked by looking at the `head()` function.

In [12]:
# Your code here:

shuttle.head()

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class
55,0,81,0,-6,11,25,88,64,4
56,0,96,0,52,-4,40,44,4,4
50,-1,89,-7,50,0,39,40,2,1
53,9,79,0,42,-2,25,37,12,4
55,2,82,0,54,-6,26,28,2,1

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated and that we are not saving the index column.

In [13]:
# Your code here:
shuttle.to_csv('/Users/danielanogueira/Ironhack/lab-import-export/your-code/shuttle.csv',sep=',',index=False)

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the same folder that contains this notebook. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [14]:
# Your code here:
astronaut=pd.read_excel('/Users/danielanogueira/Ironhack/lab-import-export/your-code/astronauts.xls')

Use the `head()` function to inspect the dataframe.

In [15]:
# Your code here:

astronaut.head()

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,NaN,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN
2,James C. Adamson,1984.0,10.0,Retired,1946-03-03,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaT,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,1951-05-20,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaT,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1930-01-20,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaT,NaN

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [16]:
# Your code here:

astronaut['Undergraduate Major'].value_counts().head(1)

Physics    35
Name: Undergraduate Major, dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a tab separated file using the `to_csv` function. Call the file `astronaut.csv` and remember to remove the index column.

In [17]:
# Your code here:
astronaut.to_csv('/Users/danielanogueira/Ironhack/lab-import-export/your-code/astronaut.csv', sep='\t', index=False)